app/views/collections/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 24 ORDER BY "users"."id" ASC LIMIT 1
---
        <div class="d-flex align-items-center me-4">
          <% if @collection.user.avatar_url.present? %>