app/views/recipes/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IN (24, 20, 22, 21)
---
            <p class="card-text text-muted small d-flex align-items-center">
              <% if recipe.user.avatar_url.present? %>