app/views/recipes/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 20 LIMIT 1
---
        <div class="d-flex align-items-center me-4">
          <% if @recipe.user.avatar_url.present? %>

SELECT "users".* FROM "users" WHERE "users"."id" = 24 ORDER BY "users"."id" ASC LIMIT 1
---
            <div class="fw-medium">By <%= link_to @recipe.user.display_name, user_path(@recipe.user), class: "text-decoration-none" %></div>
            <% if @recipe.user.bio.present? %>

SELECT "users".* FROM "users" WHERE "users"."id" = 24
---
                <div class="d-flex align-items-center">
                  <% if review.user.avatar_url.present? %>