app/views/shared/_collections_dropdown.html.erb

SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = 24
---
  <ul class="dropdown-menu">
    <% current_user.collections.each do |collection| %>