app/views/home/index.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = 24
---
              <i class="bi bi-book text-primary"></i>
              <%= current_user.recipes.count %>