app/views/home/index.html.erb

              <i class="bi bi-book text-primary"></i>
              <%= current_user.recipes.count %>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = 1