app/controllers/collections_controller.rb

  def index
    if params[:user_id]
      @user = User.find(params[:user_id])
      @collections = @user.collections.includes(:user, :recipes)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 24 LIMIT 1
SELECT "collections".* FROM "collections" WHERE "collections"."user_id" = 24 ORDER BY "collections"."updated_at" DESC
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (51, 50, 44, 40)
SELECT "users".* FROM "users" WHERE "users"."id" = 24 ORDER BY "users"."id" ASC LIMIT 1

  def show
    @recipes = @collection.recipes.includes(:user, :reviews).order('collection_recipes.position')
---
SELECT "recipes".* FROM "recipes" INNER JOIN "collection_recipes" ON "recipes"."id" = "collection_recipes"."recipe_id" WHERE "collection_recipes"."collection_id" = 16 ORDER BY collection_recipes.position
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (51, 50, 44, 40)
SELECT "users".* FROM "users" WHERE "users"."id" IN (20, 21)

  def create
    @collection = current_user.collections.build(collection_params)

    if @collection.save
---
INSERT INTO "collections" ("user_id", "name", "description", "is_public", "created_at", "updated_at") VALUES (24, 'Home ', 'Stuff I like to cook at home', 1, '2025-07-16 20:42:38.846306', '2025-07-16 20:42:38.846306') RETURNING "id"

  def add_recipe
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 51 LIMIT 1

  def set_collection
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = 17 LIMIT 1