app/controllers/favorites_controller.rb

  def toggle
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 51 LIMIT 1