app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" LEFT OUTER JOIN "reviews" ON "reviews"."recipe_id" = "recipes"."id" GROUP BY "recipes"."id" ORDER BY AVG(reviews.rating) DESC NULLS LAST, recipes.created_at DESC
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" IN (52, 51, 50, 49, 48, 47, 46, 45, 44, 43, 42, 41, 40, 39)
SELECT "users".* FROM "users" WHERE "users"."id" IN (2, 1)
SELECT 1 AS one FROM "recipes" WHERE "recipes"."user_id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) AS "count_all", "recipes"."id" AS "recipes_id" FROM "recipes" LEFT OUTER JOIN "reviews" ON "reviews"."recipe_id" = "recipes"."id" GROUP BY "recipes"."id" ORDER BY AVG(reviews.rating) DESC NULLS LAST, recipes.created_at DESC
INSERT INTO "recipes" ("title", "description", "ingredients", "instructions", "prep_time", "cook_time", "servings", "user_id", "created_at", "updated_at") VALUES ('test', 'test test test test', 'test', 'test', 1, 1, 1, 1, '2025-07-09 01:00:15.269879', '2025-07-09 01:00:15.269879') RETURNING "id"
---
  def index
    @recipes = Recipe.includes(:user, :reviews).all
    @recipes = @recipes.where(user_id: params[:user]) if params[:user].present?

    # Sort by different criteria
    case params[:sort]
    when 'rating'
      @recipes = @recipes.left_joins(:reviews)
                        .group('recipes.id')
                        .order(Arel.sql('AVG(reviews.rating) DESC NULLS LAST, recipes.created_at DESC'))
    when 'reviews'
      @recipes = @recipes.left_joins(:reviews)
                        .group('recipes.id')
                        .order(Arel.sql('COUNT(reviews.id) DESC, recipes.created_at DESC'))

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = 51 ORDER BY "reviews"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (23, 22, 20)
---
  def show
    @reviews = @recipe.reviews.includes(:user).recent

INSERT INTO "recipes" ("title", "description", "ingredients", "instructions", "prep_time", "cook_time", "servings", "user_id", "created_at", "updated_at") VALUES ('Skillet Tarragon Chicken', 'This delicious chicken and easy creamy tarragon wine sauce cook right on the stove top. People will think you went to culinary school to learn how to make something this good! Do not worry about the cream in here. It is only 1/4 cup divided between 6 people. Just enough to give you that smooth creaminess you have been craving! Oh MY this is so good! We love this over some simple white or brown rice with a green salad on the side. Oh and the rest of that bottle of wine! hehee Enjoy!', '• 6       boneless skinless chicken breasts (can use bone in but adjust time) or 6       boneless skinless chicken thighs (can use bone in but adjust time)
---
  def create
    @recipe = current_user.recipes.build(recipe_params)

    if @recipe.save