app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("recipe_id", "user_id", "rating", "comment", "created_at", "updated_at") VALUES (51, 24, 5, 'Easy and delicious. Easy on the salt, it crept up on me and I think mine was a bit too salty.', '2025-07-16 20:11:01.879819', '2025-07-16 20:11:01.879819') RETURNING "id"
---
  def create
    @review = @recipe.reviews.build(review_params)
    @review.user = current_user

    if @review.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = 51 LIMIT 1
---
  def set_recipe
    @recipe = Recipe.find(params[:recipe_id])