app/controllers/users_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = 24 ORDER BY "recipes"."created_at" DESC LIMIT 12
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = 24
---
  def show
    @recipes = @user.recipes.order(created_at: :desc).limit(12)
    @total_recipes = @user.recipes.count