app/models/collection.rb

  def add_recipe(recipe)
    return false if recipes.include?(recipe)

    next_position = collection_recipes.maximum(:position).to_i + 1
    collection_recipes.create(recipe: recipe, position: next_position)
---
INSERT INTO "collection_recipes" ("collection_id", "recipe_id", "position", "created_at", "updated_at") VALUES (2, 42, 1, '2025-07-16 20:36:06.802239', '2025-07-16 20:36:06.802239') RETURNING "id"

  def remove_recipe(recipe)
    collection_recipes.find_by(recipe: recipe)&.destroy
---
DELETE FROM "collection_recipes" WHERE "collection_recipes"."id" = 43