app/models/user.rb

  def favorites_collection
    collections.find_or_create_by(name: 'Favorites') do |collection|
---
INSERT INTO "collections" ("user_id", "name", "description", "is_public", "created_at", "updated_at") VALUES (20, 'Favorites', 'My favorite recipes', 0, '2025-07-16 20:36:06.760897', '2025-07-16 20:36:06.760897') RETURNING "id"