app/views/layouts/application.html.erb

SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = 24
SELECT COUNT(*) FROM "collections" WHERE "collections"."user_id" = 24
---
                  <li><%= link_to '<i class="bi bi-person-circle"></i> View Profile'.html_safe, user_path(current_user), class: "dropdown-item" %></li>
                  <li><%= link_to '<i class="bi bi-book"></i> My Recipes <span class="badge bg-secondary ms-1">'.html_safe + current_user.recipes.count.to_s + '</span>'.html_safe, recipes_path(user: current_user.id), class: "dropdown-item" %></li>
                  <li><%= link_to '<i class="bi bi-collection"></i> My Collections <span class="badge bg-secondary ms-1">'.html_safe + current_user.collections.count.to_s + '</span>'.html_safe, user_collections_path(current_user), class: "dropdown-item" %></li>