app/views/layouts/application.html.erb

                  <li><%= link_to "Edit Profile", edit_user_registration_path, class: "dropdown-item" %></li>
                  <li><%= link_to '<i class="bi bi-book"></i> My Recipes <span class="badge bg-secondary ms-1">'.html_safe + current_user.recipes.count.to_s + '</span>'.html_safe, recipes_path(user: current_user.id), class: "dropdown-item" %></li>
---
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = 1